docs: Rewrite documentation
